In [1]:
# Table 2

In [2]:
# ID Level spec from Yoram, modified on 20191115
# Email 20191115 6:30 p.m.
import pandas as pd
import numpy as np
import datetime
import os
import paramiko
import sqlalchemy
import logging
import glob
import gc
logging.basicConfig(filename='/home/jian/Projects/Big_Lots/Analysis/2019_Q4/Predictive_Model_Building/predictive_dataset_building.log',level="INFO")

print(datetime.datetime.now())
print(os.getcwd())

# IDs to include since 2018Q1

BL_SQL_CONNECTION= 'mysql+pymysql://jian:JubaPlus-2017@localhost/BigLots' 
BL_engine = sqlalchemy.create_engine(
        BL_SQL_CONNECTION, 
        pool_recycle=1800
    )

2020-01-14 10:38:22.377535
/home/jian/Projects/Big_Lots/Analysis/2019_Q4/Predictive_Model_Building

In [3]:
pd.read_sql("show tables;",con=BL_engine)

/usr/local/lib/python3.6/site-packages/pymysql/cursors.py:166: Warning: (1287, "'@@tx_isolation' is deprecated and will be removed in a future release. Please use '@@transaction_isolation' instead")
  result = self._query(query)

     Tables_in_BigLots
0          BL_POS_Item
1      BL_POS_Subclass
2    BL_Rewards_Master
3       Pred_CRM_table
4  Pred_POS_Department

# LTV Table

In [4]:
pd.read_sql("desc  Pred_POS_Department;",con=BL_engine)

                    Field           Type Null  Key Default Extra
0             location_id        int(11)  YES  MUL    None
1          transaction_dt           date  YES  MUL    None
2          transaction_id    varchar(16)  YES         None
3      customer_id_hashed       char(64)  YES  MUL    None
4           department_id    varchar(16)  YES  MUL    None
5                   sales  decimal(10,2)  YES         None
6                   units        int(11)  YES         None
7  trans_order_since_18Q1        int(11)  YES  MUL    None

In [14]:
pd.read_sql("select min(transaction_dt),max(transaction_dt) from Pred_POS_Department;",con=BL_engine)

  min(transaction_dt) max(transaction_dt)
0          2018-02-04          2019-12-28

In [5]:
print("start query",datetime.datetime.now())

df_LTV_overall=pd.read_sql("select customer_id_hashed, max(trans_order_since_18Q1) as total_trans, sum(units) as total_items, sum(sales) as total_sales, \
count(distinct case when location_id!=6990 then trans_order_since_18Q1 end) as InStore_trans, \
count(distinct case when location_id!=6990 then location_id end) as Unique_Store_counts_no_6990, \
count(distinct case when location_id=6990 then trans_order_since_18Q1 end) as Online_trans \
from Pred_POS_Department \
where customer_id_hashed is not null \
group by customer_id_hashed;",con=BL_engine)

print("finish query",datetime.datetime.now())
df_LTV_overall.shape

(24492751, 7)

In [15]:
df_LTV_overall.to_csv("./BL_all_LTV_18Q1_to_191228_JL_"+str(datetime.datetime.now().date())+".csv",index=False)

In [16]:
df_example_POS_department=pd.read_sql("select * from Pred_POS_Department limit 20;",con=BL_engine)
df_example_POS_department

,location_id,transaction_dt,transaction_id,customer_id_hashed,department_id,sales,units,trans_order_since_18Q1
0,5137,2018-02-08,3863,0000355c755ac22a52bdcd0ff7bd29b87df5191a9c6a07...,108,2.00,1,1
1,5137,2018-02-08,3863,0000355c755ac22a52bdcd0ff7bd29b87df5191a9c6a07...,111,5.40,3,1
2,1875,2018-02-07,583,00004d161929f36dc892fae11bff1c106d699e51daf5e0...,109,6.18,7,1
3,1875,2018-02-07,583,00004d161929f36dc892fae11bff1c106d699e51daf5e0...,120,5.82,1,1
4,822,2018-02-09,5775,00005467f85fb0c0fe7fe07ade6ae26f253557b00d85dd...,114,5.90,3,1
5,822,2018-02-09,5775,00005467f85fb0c0fe7fe07ade6ae26f253557b00d85dd...,120,2.50,2,1
6,822,2018-02-09,5775,00005467f85fb0c0fe7fe07ade6ae26f253557b00d85dd...,520,7.00,2,1
7,4568,2018-02-04,3624,00005b58803e96908ce628f77ef5becbc47979a38de18d...,170,31.90,3,1
8,5215,2018-02-08,6199,0000784242afecb251c9cfe90d8d3c1246526071b87ede...,108,4.75,3,1
9,5215,2018-02-08,6199,0000784242afecb251c9cfe90d8d3c1246526071b87ede...,109,3.00,1,1
10,5215,2018-02-08,6199,0000784242afecb251c9cfe90d8d3c1246526071b87ede...,110,2.00,2,1
11,5215,2018-02-08,6199,0000784242afecb251c9cfe90d8d3c1246526071b87ede...,114,2.00,2,1
12,5215,2018-02-08,6199,0000784242afecb251c9cfe90d8d3c1246526071b87ede...,120,3.50,1,1
13,4393,2018-02-08,3696,00007ec4ed190457b3f336327cdaa39e98bb818c6ef907...,110,2.65,2,1
14,4393,2018-02-08,3696,00007ec4ed190457b3f336327cdaa39e98bb818c6ef907...,410,3.00,1,1
15,4108,2018-02-10,8126,0000a0023791cdc64bd0c39197e0865b6c69f0dca7b5c2...,108,3.00,3,1
16,4108,2018-02-10,8126,0000a0023791cdc64bd0c39197e0865b6c69f0dca7b5c2...,210,14.00,2,1
17,509,2018-02-06,9137,0000a146cfe1d87ecd92801ef984b72324a49cc5af429e...,108,2.50,1,1
18,509,2018-02-06,9137,0000a146cfe1d87ecd92801ef984b72324a49cc5af429e...,160,12.28,4,1
19,4583,2018-02-10,1381,0000a4425aec2bd73e860c2e9ec7cfa662c8909cf399f0...,110,2.88,1,1

In [ ]:
df_LTV_overall['customer_id_hashed'].nunique()